#### Terraform Plan 📖

**Init**: `success`
**Plan**: `success`

<details><summary>Show Plan</summary>

```
random_id.bucket_suffix: Refreshing state... [id=SQ0_rg]
data.archive_file.discord_bot: Reading...
data.archive_file.discord_bot_worker: Reading...
data.archive_file.discord_bot: Read complete after 0s [id=6ae34b4a183cda5a4b3a3dab715621e847bf4368]
data.archive_file.discord_bot_worker: Read complete after 0s [id=6ae34b4a183cda5a4b3a3dab715621e847bf4368]
data.aws_ami.amazon_linux_2023: Reading...
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.minecraft: Refreshing state... [id=/minecraft/server]
aws_lambda_layer_version.discord_bot_deps: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps:10]
aws_iam_role.discord_bot: Refreshing state... [id=minecraft-prod-discord-bot-role]
aws_iam_role.minecraft: Refreshing state... [id=minecraft-prod-ec2-role]
aws_eip.minecraft: Refreshing state... [id=eipalloc-0f01ebc0e46c777d5]
aws_vpc.main: Refreshing state... [id=vpc-0421861a02aaa9d2b]
aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:ap-northeast-1:539247480224:minecraft-prod-alerts]
aws_s3_bucket.ssm: Refreshing state... [id=minecraft-prod-ssm-490d3fae]
data.aws_caller_identity.current: Read complete after 1s [id=539247480224]
aws_s3_bucket.backup: Refreshing state... [id=minecraft-prod-backup-490d3fae]
aws_iam_role_policy.discord_bot_ssm: Refreshing state... [id=minecraft-prod-discord-bot-role:minecraft-prod-discord-bot-ssm-policy]
aws_iam_role_policy_attachment.discord_bot_logs: Refreshing state... [id=minecraft-prod-discord-bot-role-20260303043906394300000002]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=minecraft-prod-ec2-role-20260303043906070200000001]
aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=minecraft-prod-ec2-role:minecraft-prod-cloudwatch-logs-policy]
aws_iam_role_policy.ec2_self_stop: Refreshing state... [id=minecraft-prod-ec2-role:minecraft-prod-ec2-self-stop]
aws_iam_instance_profile.minecraft: Refreshing state... [id=minecraft-prod-instance-profile]
aws_cloudwatch_log_metric_filter.player_left: Refreshing state... [id=minecraft-prod-player-left]
aws_cloudwatch_log_metric_filter.player_joined: Refreshing state... [id=minecraft-prod-player-joined]
aws_cloudwatch_log_metric_filter.errors: Refreshing state... [id=minecraft-prod-errors]
aws_sns_topic_subscription.email[0]: Refreshing state... [id=arn:aws:sns:ap-northeast-1:539247480224:minecraft-prod-alerts:295aa5de-09c3-478b-ac61-dccb6cd8ae97]
aws_cloudwatch_metric_alarm.billing[0]: Refreshing state... [id=minecraft-prod-billing]
data.aws_ami.amazon_linux_2023: Read complete after 2s [id=ami-099da3c6c9e8abd22]
aws_internet_gateway.main: Refreshing state... [id=igw-078bd755c07663b7e]
aws_subnet.public: Refreshing state... [id=subnet-07ce5320319e9fe53]
aws_security_group.minecraft: Refreshing state... [id=sg-054f2272d94b97677]
aws_route_table.public: Refreshing state... [id=rtb-025568c68c2b35cb6]
aws_vpc_security_group_ingress_rule.minecraft_game: Refreshing state... [id=sgr-08e06dcd10c326aef]
aws_vpc_security_group_egress_rule.allow_all: Refreshing state... [id=sgr-0f8f64945aa93723a]
aws_vpc_security_group_ingress_rule.minecraft_rcon: Refreshing state... [id=sgr-08e9650f61cca62e6]
aws_vpc_security_group_ingress_rule.minecraft_geyser: Refreshing state... [id=sgr-0b0ee91d1812ce6fd]
aws_instance.minecraft: Refreshing state... [id=i-0d3eb19e1dd8c28ee]
aws_s3_bucket_public_access_block.ssm: Refreshing state... [id=minecraft-prod-ssm-490d3fae]
aws_s3_bucket_lifecycle_configuration.ssm: Refreshing state... [id=minecraft-prod-ssm-490d3fae]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-01b7df08e854f8128]
aws_s3_bucket_versioning.backup: Refreshing state... [id=minecraft-prod-backup-490d3fae]
aws_s3_bucket_server_side_encryption_configuration.backup: Refreshing state... [id=minecraft-prod-backup-490d3fae]
aws_s3_bucket_public_access_block.backup: Refreshing state... [id=minecraft-prod-backup-490d3fae]
aws_iam_role_policy.name: Refreshing state... [id=minecraft-prod-ec2-role:minecraft-prod-s3-backup-policy]
aws_s3_bucket_lifecycle_configuration.backup: Refreshing state... [id=minecraft-prod-backup-490d3fae]
aws_cloudwatch_metric_alarm.status_check: Refreshing state... [id=minecraft-prod-status-check]
aws_eip_association.minecraft: Refreshing state... [id=eipassoc-090d6514bb87e1340]
aws_iam_role_policy.discord_bot_ec2: Refreshing state... [id=minecraft-prod-discord-bot-role:minecraft-prod-discord-bot-ec2-policy]
aws_lambda_function.discord_bot_worker: Refreshing state... [id=minecraft-prod-discord-bot-worker]
aws_cloudwatch_metric_alarm.cpu_high: Refreshing state... [id=minecraft-prod-cpu-high]
aws_cloudwatch_log_group.discord_bot_worker: Refreshing state... [id=/aws/lambda/minecraft-prod-discord-bot-worker]
aws_iam_role_policy.discord_bot_invoke_worker: Refreshing state... [id=minecraft-prod-discord-bot-role:minecraft-prod-discord-bot-invoke-worker-policy]
aws_lambda_function.discord_bot: Refreshing state... [id=minecraft-prod-discord-bot]
aws_lambda_function_url.discord_bot: Refreshing state... [id=minecraft-prod-discord-bot]
aws_cloudwatch_metric_alarm.lambda_errors: Refreshing state... [id=minecraft-prod-lambda-errors]
aws_cloudwatch_metric_alarm.lambda_duration: Refreshing state... [id=minecraft-prod-lambda-duration]
aws_cloudwatch_log_group.discord_bot: Refreshing state... [id=/aws/lambda/minecraft-prod-discord-bot]
aws_cloudwatch_dashboard.minecraft: Refreshing state... [id=minecraft-prod-dashboard]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # aws_lambda_function.discord_bot will be updated in-place
  ~ resource "aws_lambda_function" "discord_bot" {
        id                             = "minecraft-prod-discord-bot"
      ~ last_modified                  = "2026-03-04T07:13:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps:10",
        ] -> (known after apply)
      ~ source_code_hash               = "AwgFQKemecthzroUE5u4ibDQJshrtElWG4BoczU+i4M=" -> "1dzeU/QnaZYr32ia8HqepaDNSIWkO/v5EVX6r7F93is="
        tags                           = {
            "Environment" = "prod"
            "ManagedBy"   = "OpenTofu"
            "Project"     = "minecraft"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.discord_bot_worker will be updated in-place
  ~ resource "aws_lambda_function" "discord_bot_worker" {
        id                             = "minecraft-prod-discord-bot-worker"
      ~ last_modified                  = "2026-03-04T07:13:42.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps:10",
        ] -> (known after apply)
      ~ source_code_hash               = "AwgFQKemecthzroUE5u4ibDQJshrtElWG4BoczU+i4M=" -> "1dzeU/QnaZYr32ia8HqepaDNSIWkO/v5EVX6r7F93is="
        tags                           = {
            "Environment" = "prod"
            "ManagedBy"   = "OpenTofu"
            "Project"     = "minecraft"
        }
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DISCORD_APPLICATION_ID" = "1477486323991580914" -> ""
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.discord_bot_deps must be replaced
-/+ resource "aws_lambda_layer_version" "discord_bot_deps" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps:10" -> (known after apply)
      ~ code_sha256                 = "Pt9hGw2E6rcl39EwM2rmB9dkgcDGtWVq4avgRxh2+W4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-04T07:13:36.582+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:539247480224:layer:minecraft-prod-discord-bot-deps" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Pt9hGw2E6rcl39EwM2rmB9dkgcDGtWVq4avgRxh2+W4=" -> "47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU=" # forces replacement
      ~ source_code_size            = 16473301 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.email[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_sns_topic_subscription" "email" {
      - arn                             = "arn:aws:sns:ap-northeast-1:539247480224:minecraft-prod-alerts:295aa5de-09c3-478b-ac61-dccb6cd8ae97" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "jouaki.mt@gmail.com" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ap-northeast-1:539247480224:minecraft-prod-alerts:295aa5de-09c3-478b-ac61-dccb6cd8ae97" -> null
      - owner_id                        = "539247480224" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "email" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:ap-northeast-1:539247480224:minecraft-prod-alerts" -> null
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```

</details>

*Pushed by: @Jo042, Action: `pull_request`*